app/controllers/points_controller.rb

  def index
    @points = Point.all
---
SELECT `points`.* FROM `points`

  def edit
    @point = Point.find(params[:id])
---
SELECT `points`.* FROM `points` WHERE (`points`.`id` = 1) LIMIT 1

  def create
    @point = Point.new(params[:point])

    respond_to do |format|
      if @point.save
---
INSERT INTO `points` (`address`, `created_at`, `updated_at`, `visit_number`) VALUES ('werwq', '2011-01-29 11:23:48', '2011-01-29 11:23:48', 0)

  def update
    @point = Point.find(params[:id])

    respond_to do |format|
      if @point.update_attributes(params[:point])
---
SELECT `points`.* FROM `points` WHERE (`points`.`id` = 1) LIMIT 1
UPDATE `points` SET `address` = 'sdg', `updated_at` = '2011-01-29 11:26:11' WHERE (`points`.`id` = 1)