app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def list
    @products = Product.all

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 1) LIMIT 1
---
  def view
    id = params[:id].to_i
    @product = Product.find_by_id(id)

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 1) LIMIT 1
---
  def new_code
    product = Product.find(params[:id])

SELECT `products`.* FROM `products`
---
  def index
    @products = Product.all

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 1) LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 1) LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("created_at", "description", "name", "updated_at") VALUES ('2010-10-30 13:10:58.592497', 'basgasfg', 'asbsf', '2010-10-30 13:10:58.592497') RETURNING "id"
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 1) LIMIT 1
UPDATE `products` SET `description` = 'asdf adlkab lsdk jdsf adf \r\nd\r\nfs sd\r\nf \r\ndsf\r\n df sdf sdf sdg sdg\r\n sfg sf sfg sfg sf\r\ng sf s\r\nfg sfg ', `updated_at` = '2010-11-21 16:08:16' WHERE (`products`.`id` = 1)
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE ("products"."id" = 4) LIMIT 1
DELETE FROM "products" WHERE ("products"."id" = 4)
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy